Ran Plan for dir: `environment/test` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-demo/8/default/environment/test/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-demo/8/default/environment/test': exit status 1
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cb2415d6402b4e0b]
data.aws_iam_policy_document.eks_node_group_assume: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-cluster/cluster]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70]
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.eks_node_group_assume: Read complete after 0s [id=2851119427]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_iam_role.node_group_role: Refreshing state... [id=eks-node-group-role]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-cluster-cluster-20250615060512722000000001]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
aws_iam_role.atlantis_irsa_role: Refreshing state... [id=atlantis-irsa-role]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749976607494694128]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-064003e4fd33211f8]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-024233a2f504e7dfd]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e1cb27e2e90b019c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-066456d4ae5bd9ca2]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d4b963a5868114d6]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-073d470a83b7cd40e]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07b8a02fe641df9f1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e36d4c92744d97f9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c6f2c85fba0e4976]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fcc6e8dee628af00]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-08658701cca372d9c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-073f80ee84af327f1]
aws_iam_role_policy_attachment.node_group_admin_access: Refreshing state... [id=eks-node-group-role-20250615060513605300000006]
aws_iam_role_policy_attachment.node_group_worker_node: Refreshing state... [id=eks-node-group-role-20250615060513507800000004]
aws_iam_role_policy_attachment.node_group_ecr_readonly: Refreshing state... [id=eks-node-group-role-20250615060513494100000003]
aws_iam_role_policy_attachment.node_group_cni_policy: Refreshing state... [id=eks-node-group-role-20250615060513507800000005]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-20250615063704398500000001]
aws_iam_role_policy.node_group_extra_access: Refreshing state... [id=eks-node-group-role:extra-node-group-access]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b4ca6a0bd1156349]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ba5efd0b7e7f5bc5]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-eks-cluster-cluster-20250615060512722000000001-20250615060513935400000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-eks-cluster-cluster-20250615060512722000000001-20250615060513935900000008]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b1a0accebfd89703]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03c02b021493daf4c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0935349243a0267fd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e36d4c92744d97f91080289494]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1023882333]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-700058484]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-491132214]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3774377186]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2533712648]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4228035046]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-4087632067]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2180224822]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-83006069]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1482494473]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2479454492]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250615060513384900000002]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a492a3cca1f4d445]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3107139151]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6e411100-b970-4f95-8e84-cdbbcaf77104]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07b8a02fe641df9f11080289494]
aws_iam_role_policy.atlantis_policy: Refreshing state... [id=atlantis-irsa-role:atlantis-iam-policy]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250615060513384900000002-2025061506051412440000000b]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250615060513384900000002-2025061506051411650000000a]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250615060513384900000002-20250615060514099600000009]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.atlantis_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "atlantis_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:default:atlantis-new",
                ]
              + variable = "oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_openid_connect_provider.oidc must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc" {
      ~ arn             = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" -> (known after apply)
      ~ id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" -> (known after apply)
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
      ~ url             = "oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70" -> "https://oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.atlantis_irsa_role will be updated in-place
  ~ resource "aws_iam_role" "atlantis_irsa_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70:sub" = "system:serviceaccount:default:atlantis-new"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "atlantis-irsa-role"
        name                  = "atlantis-irsa-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_iam_role.eks_admin will be updated in-place
  ~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FF4B5D781A03AB4ECC937FCF1443EE70"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵
╷
│ Error: reading KMS Key (6e411100-b970-4f95-8e84-cdbbcaf77104): listing tags for KMS Key (6e411100-b970-4f95-8e84-cdbbcaf77104): operation error KMS: ListResourceTags, https response error StatusCode: 400, RequestID: 14a056d5-2e2c-4115-96cb-523370ac38c0, api error AccessDeniedException: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749976607494694128 is not authorized to perform: kms:ListResourceTags on resource: arn:aws:kms:eu-central-1:895976263444:key/6e411100-b970-4f95-8e84-cdbbcaf77104 because no resource-based policy allows the kms:ListResourceTags action
│ 
│   with module.eks.module.kms.aws_kms_key.this[0],
│   on .terraform/modules/eks.kms/main.tf line 18, in resource "aws_kms_key" "this":
│   18: resource "aws_kms_key" "this" {
│ 
╵

```
</details>